# CantCopyFrom2dTo3dFam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyFrom2dTo3dFam Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy 2D element(s) into a 3D family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyFrom2dTo3dFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyFrom2dTo3dFam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyFrom2dTo3dFam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace